{"Order":10,"Name":"How to configure Segments","Icon":null,"Languages":[{"Code":"en","Title":"How to configure Segments","Slug":"configure-segments","ContentType":"md","Content":"## Segments\nIf customer success is the goal, segmenting customers into groups with similar characteristics and needs should be the first thing to be done.\nSegment your customers into groups based on  traits to manage your customers and perform bulk actions better.\n\n### How to configure Segment in Churn360\n\n1. Login to Churn360\n2. Click on **Settings**→ **Configurations**→**Segments**\n3. Click on **Create segment** on the top right on the segment page\n4. Select any one of the **Segment types**, either **Static** or **Dynamic**\n:::(Info) (Note:)\n**Static**: You can select customers that you need to group into a segment manually \n\n**Dynamic**: You can create  customers based on certain conditions and group them into a segment automatically\n\n> For example, In Dynamic, if you set a condition where the field is a \"CSM name\" with an operator \"Starts with\" a Value \"A\" (This would be the starting letter of the CSMs name), you will get the customer list that match the condition for the segment along with Health score, Renewal date and Last engaged date of all the customers assigned to the CSMs whose names starts with the letter \"A\". As this acts dynamically, newly added customers that match the set condition will also be grouped under it automatically.\n\nWe can create multiple conditions like the above \n\n:::\n\n5. Click on **Next**\n\n\n:::(Info) (Note:)\n\n* In created Segments, we can view the segment name, number of accounts, created by, Created date and status of the segments.\n\n* You can edit and update the existing and newly created segments.\n![1_Screenshot_Updating_segment_Information_Segment](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/1_Screenshot_Updating_segment_Information_Segment.png){height=\"\" width=\"\"}\n\n:::\n#### How to delete or edit  a segment \n\nTo delete or edit a segment, click the **delete** or **edit** icon under the **Action** column to do the intended action.\n\n![1_Screenshot_Segments_deleting_segment](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/1_Screenshot_Segments_deleting_segment.png){height=\"\" width=\"\"}\n\n You can sort the created segments in the segment grid and search a it using the search bar adjacent to the Create segment button.\n","OriginalURI":"https://docs.churn360.com/docs/configure-segments"}],"CategoryType":1}