{"Order":2,"Name":"Feedback","Icon":null,"Languages":[{"Code":"en","Title":"Feedback","Slug":"feedback-1","ContentType":"md","Content":"### Workspace-Feedbacks:\nIn order to determine customer satisfaction among existing customers, consumer input is required. It's critical to know how customers feel about your product, support, and company these days. We have input on Churn360's Workspace that can assist you in resolving this issue.\n\n![image.png](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/image%2892%29.png){height=\"\" width=\"\"}\n\n### Feedback-Integration:\n**The following are the steps to integrate feedback:**\n**Step 1:** Add Canny to your settings by going to Home->Settings->Integrations->Canny. Enter the API key to connect to Canny.\n**Step 2:** Go to Workspace - After Integration Feedback. Canny's feedback data will be displayed.\n    \n\n![image.png](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/image%2893%29.png){height=\"\" width=\"\"}\n\n![image.png](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/image%2894%29.png){height=\"\" width=\"\"}\n\n### Workspace-Feedback: Board View\n1. We have two views for viewing feedback in the workspace in Feedback. They are the Revenue View and the Board View. Users can view the Board View in feedback by default.\n2. Board View allows consumers to see the feedback of multiple people in a single board view.\n3. Users can choose a board from the Board Dropdown, and the feedback for that board will be displayed on the feedback page.\n4. Users can see the many statuses of feedback, including open, under evaluation, planned in progress, completed, and closed. In Feedback, users can additionally adjust the Status (show/hide status).\n5. Users can filter the Feedback of various fields provided (latest 1 month, last 3 months, last 6 months, last 9 months, last 1 year) by selecting the filter.\n6. In the workspace, users can sort the feedback (Trending, Top, and New).\n7. Users can examine the detailed view of Feedback by clicking on the name, likes, and comments.\n\n![image.png](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/image%2895%29.png){height=\"\" width=\"\"}\n\n### Workspace-Feedback: Revenue View\n1. We have two views for viewing feedback in the workspace in Feedback. They are the Revenue View and the Board View. Users can view the Board View in feedback by default.\n2. In the revenue view, the user can see the customer's total revenue from feedback.\n3. In Workspace's filter dropdown, users can select the filter and filter the Feedback of various fields provided (last 1 month, last 3 months, last 6 months, last 9 months, last 1 year).\n4. Users can examine the detailed view of Feedback in the revenue view by clicking the Feedback name.\n5. In the revenue view, users may see the total votes, user votes, customer number, and total revenue calculation.\n![image.png](https://cdn.document360.io/b618a27d-7a6e-4dfb-84d1-30d3ef656644/Images/Documentation/image%2896%29.png){height=\"\" width=\"\"}\n\n\n","OriginalURI":"https://docs.churn360.com/docs/feedback-1"}],"CategoryType":1}